In [176]:
import pandas as pd
import numpy as np

In [26]:
data = {
    'A': [1,2,3],
    'B': [4,5,6]
}

df = pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [14]:
df.sum()
df.mean()
df.median()
df.min()
df.max()
df.count()
df.std()
df.var()
df.describe()

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [25]:
df.apply(lambda a: a*2)
df['B'].map(lambda b: b**2)
df

   A  B  Double  Double A
0  1  4       2         2
1  2  5       4         4
2  3  6       6         6

In [33]:
df['Double A'] = df.apply(lambda row: row['A'] * 2, axis=1)
df['Squared B'] = df['B'].apply(lambda a: a**2)
df

   A  B  Double A  Squared B
0  1  4         2         16
1  2  5         4         25
2  3  6         6         36

In [35]:
df['A_squared'] = df['A'].map(lambda a:a**2)
df

   A  B  Double A  Squared B  A_squared
0  1  4         2         16          1
1  2  5         4         25          4
2  3  6         6         36          9

In [43]:
df['A'].transform(lambda a: a**2)

0    1
1    4
2    9
Name: A, dtype: int64

In [55]:
df[df['B'] > 4]
df.loc[:1,['B']]
df.iloc[:2]

   A  B  Double A  Squared B  A_squared
0  1  4         2         16          1
1  2  5         4         25          4

In [177]:
df_z = pd.read_csv(r'C:\Users\user\OneDrive\Documents\DataScience\Python\Zomato-data-.csv')
df_z.info()
df_z.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         148 non-null    object
 1   online_order                 148 non-null    object
 2   book_table                   148 non-null    object
 3   rate                         148 non-null    object
 4   votes                        148 non-null    int64
 5   approx_cost(for two people)  148 non-null    int64
 6   listed_in(type)              148 non-null    object
dtypes: int64(2), object(5)
memory usage: 8.2+ KB

             votes  approx_cost(for two people)
count   148.000000                   148.000000
mean    264.810811                   418.243243
std     653.676951                   223.085098
min       0.000000                   100.000000
25%       6.750000                   200.000000
50%      43.500000                   400.000000
75%     221.750000                   600.000000
max    4884.000000                   950.000000

In [62]:
df_z.head(5)

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
4,Grand Village,No,No,3.8/5,166,600,Buffet

In [63]:
df_z.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         148 non-null    object
 1   online_order                 148 non-null    object
 2   book_table                   148 non-null    object
 3   rate                         148 non-null    object
 4   votes                        148 non-null    int64
 5   approx_cost(for two people)  148 non-null    int64
 6   listed_in(type)              148 non-null    object
dtypes: int64(2), object(5)
memory usage: 8.2+ KB

In [73]:
df_z['listed_in(type)'].value_counts().sort_values(ascending=False)
# df_z.groupby('listed_in(type)').size()

listed_in(type)
Dining    110
Cafes      23
other       8
Buffet      7
Name: count, dtype: int64

In [108]:
# df_z['name'].value_counts().head()
# df_z.groupby('name').size()
# df_z.query('name == "CAFE NOVA" ')
# df_z.loc[df_z['name'] == 'CAFE NOVA']
# print(df_z.loc[df_z['listed_in(type)'] == 'Dining'])
df_z[df_z['name'].isin(['Spice Elephant', 'San Churro Cafe'])]

# df_z.groupby('listed_in(type)').size().sort_values(ascending=False)

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
14,San Churro Cafe,Yes,No,3.8/5,918,800,Cafes

In [142]:
# df_z[df_z['name'].str.contains('ant', case=False)]
# df_z.info()
df_z[df_z['name'].apply(lambda a: a.lower() == 'spice elephant')]
# df_z.groupby('name').count()
# df_z.query('name == "Spice Elephant"')
# df_z.loc[df_z['name'] == 'Spice Elephant']

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet

In [155]:
df_z['rate'].value_counts().sort_values(ascending=False) 
# df_z.info()

rate
3.8/5     19
3.7/5     15
3.3/5     14
3.4/5     12
4.1/5     11
3.6/5     11
4.0/5     10
3.9/5     10
4.2/5      8
3.2/5      7
2.9/5      7
3.1/5      7
3.5/5      6
3.0/5      2
4.6/5      2
2.8/5      2
4.4/5      2
4.3/5      1
2.6/5      1
3.8 /5     1
Name: count, dtype: int64

In [159]:
df_z.groupby('online_order').size().sort_values(ascending=False)

online_order
No     90
Yes    58
dtype: int64

In [168]:
df_z.groupby('name')['name'].count().sort_values(ascending=False)
# df_z.query('name == "Onesta"')

name
Onesta                   2
San Churro Cafe          2
CAFE NOVA                2
Polar Bear               1
Ovenstory Pizza          1
                        ..
Frozen Bottle            1
Gawdaru Mane Beriyani    1
Goa 0 Km                 1
Grand Village            1
XO Belgian Waffle        1
Name: name, Length: 145, dtype: int64

In [174]:
df_z['name'].value_counts().get('CAFE NOVA', 0)

2

In [188]:
df_z[df_z['votes']>1000].sort_values(by='votes', ascending=False)
# df_z.info()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
38,Empire Restaurant,Yes,No,4.4/5,4884,750,other
86,Meghana Foods,Yes,No,4.4/5,4401,600,Dining
7,Onesta,Yes,Yes,4.6/5,2556,600,Cafes
44,Onesta,Yes,Yes,4.6/5,2556,600,other
65,Kabab Magic,Yes,No,4.1/5,1720,400,Dining
37,Szechuan Dragon,Yes,No,4.2/5,1647,600,Dining
54,Roving Feast,No,No,4.0/5,1047,450,Dining